import { makeObservable, computed, observable } from 'mobx';

import vid_1 from '../img/1.jpg'
import vid_2 from '../img/2.jpg'
import vid_3 from '../img/3.jpg'
import vid_4 from '../img/4.jpg'
import vid_5 from '../img/5.jpg'
import vid_6 from '../img/6.jpg'
import vid_7 from '../img/7.jpg'
import vid_8 from '../img/8.jpg'
import img_9 from '../img/9.jpg'
import img_10 from '../img/10.jpg'
import img_11 from '../img/11.jpg'
import img_12 from '../img/12.jpg'


class Store{
    @observable gallery = [
        {id: 0, description: "Модель ICM Німецький легкий танк Leichttraktor Rheinmetall" ,imageUrl: img_9},
        {id: 1, description: "Відважність і міць - основні риси нацгвардійців", imageUrl: img_10},
        {id: 2, description: "Адміністративний відділ", imageUrl: vid_7},
        {id: 3, description: "Новітнє озброєння: танк", imageUrl: img_12},
        {id: 4, description: "Відділ військової кадрової політики", imageUrl: vid_1},
        {id: 5, description: "Відділ управління кар’єрою та комплектування офіцерами посад номенклатури Міністра оборони", imageUrl: vid_2},
        {id: 6, description: "Відділ кадрової роботи з державними службовцями та керівниками державних підприємств", imageUrl: vid_3},
        {id: 7, description: "Відділ кадрового забезпечення програм міжнародного співробітництва", imageUrl: vid_4},
        {id: 8, description: "Відділ нагороджень Департаменту кадрової політики Міністерства оборони Україн", imageUrl: vid_5},
        {id: 9, description: "Відділ організаційно-планової та організаційно-штатної роботи", imageUrl: vid_6},
        {id: 10, description: "Урочистий марш", imageUrl: img_11},
        {id: 11, description: "Відділ з питань визначення учасників бойових дій", imageUrl: vid_8}
    ];

    @observable statistic = [
        {id: 0, imageUrl: vid_1,
            title: "Відділ військової кадрової політики Департаменту кадрової політики Міністерства оборони України",
            description: "Основними завданнями відділу є:" +
                "\n" +
                "участь у реалізації державної політики з питань національної безпеки у сфері військової кадрової політики;" +
                "\n" +
                "участь у розробці пропозицій і проведення експертизи щодо проєктів законів України та інших нормативно-правових актів з питань військової кадрової політики;" +
                "\n" +
                "підготовка пропозицій та здійснення моніторингу щодо виконання завдань та заходів оборонної реформи;" +
                "\n" +
                "підготовки пропозицій та здійснення моніторингу щодо формування та реалізації основних положень військової кадрової політики;" +
                "\n" +
                "проведення аналізу зовнішніх і внутрішніх проблемних ситуацій та прогнозі їх розвитку і впливу на стан кадрового забезпечення в Збройних Силах України."},
        {id: 1, imageUrl: vid_2,
            title: "Відділ управління кар’єрою та комплектування офіцерами посад номенклатури Міністра оборони України Департаменту кадрової політики Міністерства оборони України",
            description: "Основними завданнями відділу є:" +
                "\n" +
                "участь у реалізації заходів державної військової кадрової політики;" +
                "\n" +
                "участь у забезпеченні комплектування посад номенклатури призначення Президента України;" +
                "\n" +
                "організація кадрової роботи щодо:" +
                "\n" +
                "комплектування особовим складом посад номенклатури призначення Міністра оборони України;" +
                "\n" +
                "присвоєння військових звань вищого офіцерського складу, первинних військових звань та військового звання полковник особам офіцерського складу Збройних Сил України, а також чергових військових звань особам офіцерського складу апарату Міністерства оборони та прикомандированим до Рад чи відрядженим до державних органів;" +
                "\n" +
                "укладення контрактів з військовослужбовцями та звільнення їх з військової служби відповідно до повноважень Міністра оборони України;" +
                "\n" +
                "направлення осіб офіцерського складу до інших військових формувань, з виключенням із списків особового складу Збройних Сил України та прийняття на військову службу за контрактом осіб офіцерського складу інших військових формувань, із зарахуванням їх до списків особового складу Збройних Сил України;" +
                "\n" +
                "відрядження осіб офіцерського складу до державних органів із залишенням на військовій службі та повернення їх у розпорядження Міністерства оборони України;" +
                "\n" +
                "прикомандирування осіб офіцерського складу до Рад із залишенням їх на військовій службі та повернення їх у розпорядження Міністерства оборони України відповідно до вимог законодавства;"},
        {id: 2, imageUrl: vid_3,
            title: "Відділ кадрової роботи з державними службовцями та керівниками державних підприємств Департаменту кадрової політики Міністерства оборони України",
            description: "Основними завданнями відділу є:" +
                "\n" +
                "забезпечення реалізації кадрової політики з питань державної служби;" +
                "\n" +
                "здійснення кадрової роботи з державними службовцями в апараті Міністерства;" +
                "\n" +
                "координація та контроль, у межах компетенції, проведення заходів у структурних підрозділах апарату Міністерства та підпорядкованих органах військового управління щодо забезпечення реалізації державної політики у сфері державної служби;" +
                "\n" +
                "координація роботи щодо комплектування посад державних службовців кваліфікованими кадрами та їх ефективного використання;" +
                "\n" +
                "організація та ведення кадрової роботи з керівниками державних підприємств, установ та організацій, що належать до сфери управління Міністерства оборони України, цивільних посад керівників органів військового управління, військових частин, установ та організацій Збройних Сил України;" +
                "\n" +
                "забезпечення та здійснення контролю за дотриманням трудової дисципліни, правил внутрішнього розпорядку та з питань охорони праці;" +
                "\n" +
                "документальне оформлення проходження особами державної служби та їх трудових відносин у апараті Міністерства."},
        {id: 3, imageUrl: vid_4,
            title: "Відділ кадрового забезпечення програм міжнародного співробітництва",
            description: "Основними завданнями відділу є:" +
                "\n" +
                "участь у формуванні та реалізації військової кадрової політики з питань проходження військової служби і навчання військовослужбовців і працівників ЗС України за кордоном;" +
                "\n" +
                "кадрове забезпечення представництва України в багатонаціональних органах військового управління та закордонних дипломатичних установах України, інших міжнародних організаціях, на посадах національного персоналу;" +
                "\n" +
                "кадрове забезпечення участі підрозділів Збройних Сил України у міжнародних операціях з підтримання миру і безпеки визначеної номенклатури призначення;" +
                "\n" +
                "організація фахової та мовної підготовки особового складу Збройних Сил України у військових навчальних закладах, навчальних центрах країн- партнерів;" +
                "\n" +
                "організація виконання заходів у Міністерстві оборони України в рамках Міжнародного проекту професійної підготовки цивільного персоналу сектору безпеки і оборони України;" +
                "\n" +
                "організація виконання заходів європейського та євроатлантичного співробітництва з питань, віднесених до компетенції Департаменту."},
        {id: 4, imageUrl: vid_5,
            title: "Відділ нагороджень Департаменту кадрової політики Міністерства оборони України",
            description: "Основними завданнями відділу є:" +
                "\n" +
                "організація та виконання завдань щодо нагородження військовослужбовців та працівників Збройних Сил України державними нагородами України, відзнаками Верховної Ради України та Кабінету Міністрів України;" +
                "\n" +
                "організація та виконання завдань щодо нагородження особового складу Збройних Сил України та інших осіб заохочувальними відзнаками Міністерства оборони України, затверджених наказом Міністерства оборони України від 11 березня 2013 року № 165 «Про відомчі заохочувальні відзнаки Міністерства оборони України» та заохочувальними відзнаками Міністерства оборони України «Вогнепальна зброя» і «Холодна зброя», затверджених наказом Міністерства оборони України від 23 жовтня 2012 року № 693 «Про затвердження Положення про відомчі заохочувальні відзнаки Міністерства оборони України «Вогнепальна зброя» і «Холодна зброя»;" +
                "\n" +
                "організація та виконання завдань щодо заохочення особового складу Збройних Сил України, відповідно до Дисциплінарного статуту Збройних Сил України, Міністром оборони України."},
        {id: 5, imageUrl: vid_6,
            title: "Відділ організаційно-планової та організаційно-штатної роботи Департаменту кадрової політики Міністерства оборони України",
            description: "Основними завданнями відділу є:" +
                "\n" +
                "участь у формуванні та реалізації державної політики з питань національної безпеки у воєнній сфері, сфері оборони і військового будівництва, у галузі оборонного планування, військової освіти та науки;" +
                "\n" +
                "участь у розробці проектів законів України, актів Президента України, Кабінету Міністрів України, наказів, директив Міністра оборони, безпосередня їх розробка за напрямом удосконалення структури та оптимізації чисельності апарату Міністерства оборони;" +
                "\n" +
                "організація і ведення організаційно-штатної роботи в апараті Міністерства оборони;" +
                "\n" +
                "організація і ведення мобілізаційно-кадрової роботи в структурних підрозділах Міністерства оборони;" +
                "\n" +
                "перспективне і поточне планування діяльності Департаменту, • моніторинг планових заходів;" +
                "\n" +
                "організація виконання заходів організаційно-планової роботи та і повсякденної діяльності Департаменту."},
        {id: 6, imageUrl: vid_7,
            title: "Адміністративний відділ Департаменту кадрової політики Міністерства оборони України",
            description: "Основними завданнями відділу є:" +
                "\n" +
                "обробка, узагальнення та розподіл отриманої інформації серед структурних підрозділів Департаменту та інших суб’єктів інформаційного обміну з питань, віднесених до компетенції Департаменту;" +
                "\n" +
                "участь у здійсненні моніторингу стану системи кадрового забезпечення в Збройних Силах;" +
                "\n" +
                "впровадження сучасних інформаційних технологій у роботу Департаменту та кадрових органів нижчого рівня;" +
                "\n" +
                "організація єдиного порядку документування управлінської інформації і роботи з документами із застосуванням сучасних автоматизованих систем;" +
                "\n" +
                "здійснення діловодства стосовно документів, що містять інформацію з обмеженим доступом;" +
                "\n" +
                "організація стройової роботи у Департаменті; організація та ведення архівної роботи."},
        {id: 7, imageUrl: vid_8,
            title: "Відділ з питань визначення учасників бойових дій Департаменту кадрової політики Міністерства оборони України",
            description: "Основними завданнями відділу є:" +
                "\n" +
                "організація та виконання завдань щодо надання статусу учасника бойових дій особам, які захищали незалежність, суверенітет та територіальну цілісність України і брали безпосередню участь в антитерористичній операції (операції об’єднаних сил), забезпеченні її проведення;" +
                "\n" +
                "організація та виконання завдань щодо надання статусу учасника бойових дій особам, які за рішенням Уряду колишнього Союзу РСР проходили службу, працювали чи перебували у відрядженні в державах, де в цей період велися бойові дії, і брали участь у бойових діях чи забезпеченні бойової діяльності військ (флотів);" +
                "\n" +
                "організація та виконання завдань щодо надання статусу учасника бойових дій військовослужбовцям Збройних Сил України, які за рішенням відповідних державних органів були направлені для участі в міжнародних операціях з підтримання миру і безпеки або у відрядження в держави, де в цей період велися бойові дії;" +
                "\n" +
                "організація та виконання завдань щодо надання статусу учасника бойових дій військовослужбовцям Збройних Сил України, які були залучені командуванням військових частин, державними і громадськими організаціями до розмінування полів і об’єктів народного господарства;" +
                "\n" +
                "вирішення спірних питань щодо зарахування до вислуги років окремих періодів військової служби;" +
                "\n" +
                "організація проведення перевірки достовірності відомостей, що подаються посадовими і службовими особами, звільнення яких з посади належить до повноважень Міністра оборони України, першого заступника Міністра оборони України та заступника Міністра оборони України — керівника апарату, а також особами, які претендують на зайняття посад, щодо яких застосовуються заборони, передбачені Законом України «Про очищення влади»."}
    ];

    @computed get getAllImages(){
        return this.gallery;
    }

    @computed get getAllNews(){
        return this.statistic;
    }

    constructor(){
        makeObservable(this);
    }
}

export default Store;