import React from "react";
import {Container} from 'react-bootstrap';

function AboutPage() {
    return (
        <div className={"virsta-div-about"}>
            <Container>
                <h1>Про сайт</h1>

                <br/>
                <p>
                    Використання веб-технологій помітно зростає в усіх сферах людського життя, зокрема це стосується
                    військової сфери. Надзвичайно важлива роль у досягненні інформативності громадян належить
                    інформаційним
                    та комунікаційним технологіям.
                </p>
                <br/>
                <p>
                    Тому інформаційний портал «Департамент кадрової політики Міністерства оборони України», є важливим
                    етапом взаємодії армії з державою в цілому
                </p>
                <br/>
                <p>
                    Існує вісім відділів Департаменту кадрової політики Міністерства оборони України:
                </p>
                <p>
                    1. Відділ військової кадрової політики Департаменту кадрової політики Міністерства оборони України.
                </p>
                <p>
                    2. Відділ управління кар’єрою та комплектування офіцерами посад номенклатури Міністра оборони
                    України Департаменту кадрової політики Міністерства оборони України.
                </p>
                <p>
                    3. Відділ кадрової роботи з державними службовцями та керівниками державних підприємств Департаменту
                    кадрової політики Міністерства оборони України.
                </p>
                <p>
                    4. Відділ кадрового забезпечення програм міжнародного співробітництва.
                </p>
                <p>
                    5. Відділ нагороджень Департаменту кадрової політики Міністерства оборони України.
                </p>
                <p>
                    6. Відділ організаційно-планової та організаційно-штатної роботи Департаменту кадрової політики
                    Міністерства оборони України.
                </p>
                <p>
                    7. Адміністративний відділ Департаменту кадрової політики Міністерства оборони України.
                </p>
                <p>
                    8. Відділ з питань визначення учасників бойових дій Департаменту кадрової політики Міністерства
                    оборони України.

                </p>
                <br/>
                <p>
                    Інформаційний портал «Департамент кадрової політики Міністерства оборони України» забезпечить
                    українців потрібною інформацією, що стосується завдань усіх відділів Департаменту кадрової політики
                    Міністерства оборони України.
                </p>
            </Container>
        </div>
    )
}

export default AboutPage;